---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.#ctor
source: html/3ae2b35d-7807-5218-497d-a39b982bc02c.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.#ctor Method

Constructs an instance of settings with default values.

## Syntax (C#)
```csharp
public DirectContext3DHandleSettings()
```